#include <iostream>
// суть задачі вивести числа, сума цифр яких <= 40

// 1) неуважність дуже все спортила(((

// 2)проблема в тому шо поперше дуже важко все реалізовано(масиви два динамічні лишні і куча циклів)

// 3)і до того ж я шукав цифру з числа зпереду назад, а ззаду наперед легше прсто ділити на 10 і не треба ті if else шо були в минулому коді

// 4)не дочитав правильно."допоможіть Юлі вивести ці цифри в порядку спадання" а я робив в порядку зростання

//тому зараз попорбую перерробити

using namespace std;


int main() {
    int a,b;
    int num = 0;
    int sum = 0;
    int count=0;
    //замість масивів використав зразу перебирання циклу
    // отже мінус цикли запису і копіювання
    bool find = false;
    cin >> a >> b; // 2 5   2 3 4 5


cout << "C126" << " ";
    for (int i = b; i >=a; i--) {
        num = i;
        while (num > 0) {
            sum += num % 10;
            num /= 10;
        }

        if (sum <= 40) {
            find = true;
            cout << " " << i;
            count++;
        }
        sum = 0;
        if (count >= 10000) return 0;
    }




    



        if (find = false) {
            cout << "none";
        }
    
    

    return 0;
} //це все