#include <stdio.h>
#include <math.h>

int main() {
    double P, r, A, sum;
    int n, t;
    
    printf("Введіть основну суму інвестиції: ");
    scanf("%lf", &P);

    printf("Введіть річну процентну ставку (у десятковій формі): ");
    scanf("%lf", &r);

    printf("Введіть кількість нарахувань відсотків на рік (12 - щомісячно, 4 - щоквартально, 1 - щорічно): ");
    scanf("%d", &n);

    printf("Введіть час(у роках), на який ці гроші інвестуються: ");
    scanf("%d", &t);

    A = P * pow((1 + r / n), n * t);  // Обчислення майбутньої вартості інвестиції

    sum = A - P;  // Обчислення заробітку

    printf("Основна сума інвестиції: %.2lf\n", P);
    printf("Річна процентна ставка: %.2lf%%\n", r * 100);
    printf("Кількість нарахувань відсотків на рік: %d\n", n);
    printf("Час інвестиції у роках: %d\n", t);
    printf("Майбутня загальна сума інвестиції, включаючи відсотки: %.2lf\n", A);
    printf("Сума заробітку: %.2lf\n", sum);
    return 0;
}