#include <stdio.h>
#include <cmath>

int main() {
    double A, P, r, n, t;

    printf("Введіть основну суму інвестиції (P): ");
    scanf("%lf", &P);

    printf("Введіть річну відсоткову ставку (r) у десятковій формі (наприклад, 0.05 для 5%%): ");
    scanf("%lf", &r);

    printf("Введіть кількість нарахувань відсотків за рік (n): ");
    scanf("%lf", &n);

    printf("Введіть термін інвестиції у роках (t): ");
    scanf("%lf", &t);

    A = P * pow(1 + (r / n), n * t);

    printf("\nРезультати інвестицій:\n");
    printf("Початкова сума інвестиції (P): %.2f\n", P);
    printf("Річна процентна ставка (r): %.2f%%\n", r * 100);
    printf("Кількість нарахувань відсотків на рік (n): %.0f\n", n);
    printf("Термін інвестиції у роках (t): %.2f\n", t);
    printf("Загальна сума інвестиції (A): %.2f\n", A);
    printf("Сума чистого заробітку (A - P): %.2f\n", A - P);

    return 0;
}
