#include <iostream>
#include <cmath>

using namespace std;

int main(){
    double a = 0.7;
    double b = 0.05;
    double x = 0.43;
    double R; /* використано тип double, 
    тому що числа можуть мати більше чисел після коми, ніж є у float, і передбачити скільки саме буде складно*/
    double S;

    R = (pow(x, 2) * (x + 1)) / b - pow(sin(x - a), 2); 
    S = sqrt((x * b) / a) + fabs(cos(pow((x + b), 3)));
    /*використано математичні операції та математичні функції такі як: 
    піднесення до степеня, корінь, модуль, синус та косинус*/

    cout << R << endl;
    cout << S << endl;
    /* в коді використано оператори виведення та введення даних, впринципі як і у всіх наступних кодах, 
    для того, щоб бачити результат виконання програми*/

    return 0;
}
