#include <stdio.h>
#include <math.h>

int main() {
    double P, r, A;
    int n, t;

    // A = P * (1 + r/n)**(n*t)
    // A - майбутня загальна сума разом з відсотками 
    // P - основна сума інвестицій
    // r - річна процентна ставка
    // n - кількість нарахувань відсотків за рік
    // t - час інвестування у роках


    printf("Основна сума інвестиції $: ");
    scanf("%lf", &P);
    
    printf("Річна процентна ставка у відсотках: ");
    scanf("%lf", &r);
    r = r / 100;  

    printf("Кількість нарахувань відсотків на рік: ");
    scanf("%d", &n);

    printf("Період інвестування у роках: ");
    scanf("%d", &t);

    A = P * pow(1 + r / n, n * t);

    printf("\nОсновна сума інвестиції $: %.2lf\n", P); // .2lf це два числа після коми
    printf("Загальна сума інвестиції через %d років $: %.2lf\n", t, A);
    printf("Річна процентна ставка у відсотках: %.lf\n", r*100);
    printf("Кількість нарахувань за всі %d років: %.d\n", t, n*t);
    printf("Період за який нараховували кошти у роках: %.d\n", t);
    printf("Сума заробітку $: %.2lf\n", A - P);
    

    return 0;
}
