#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    const int m = 2, c = 1;//#4 цілочисельна константа | для запобігання пошкодження даних
    double x = 1.2, b = 0.7,
        fi = sqrt(m * tan(x) + abs(c * sin(x))),//#3 дійсний з подвійною точністю змінна | для коректного виконная арифметичних операцій
        epsilum = m * cos(b * x + sin(x)) + pow(c, 3);// #15  математичні операції та математичні функції // для обчислення заданої функції уяс
    cout << fi << " " << epsilum << endl;// #18 оператори виведення та введення даних | для виведення значень функцій

    return 0;
}