#include <iostream>

using namespace std;

//Написати перевантажені функції й основну програму, що їх викликає.
//а) для віднімання цілих чисел;
//б) для віднімання комплексних чисел.

void sub(int a, int b){
    cout << "Різниця чисел: "<< a-b <<endl;   
}
void sub(double a1,double b1, double a2, double b2){
if(b1 > 0){
    cout <<"Перше комплексне число: "<< a1 <<" + " << b1 <<"i"<<endl;}
else{
    cout <<"Перше комплексне число: "<< a1 <<" " << b1 <<"i"<<endl;}
if(b2 > 0){
    cout <<"Друге комплексне число: "<< a2 <<" + " << b2 <<"i"<<endl;}
else{
    cout <<"Друге комплексне число: "<< a2 <<" " << b2 <<"i"<<endl;}
if(b1-b2 > 0){
    cout <<"Різниця комплексних чисел: "<< a1-a2 <<"+"<<  b1 - b2 <<"i"<<endl;}
else {
    cout <<"Різниця комплексних чисел: "<< a1-a2 <<"" << b1 - b2 <<"i"<<endl;
}
}

int main(){
int a,b;
double r1,u1,r2,u2;
cout <<"Введіть 2 цілих числа"<<endl;
cin >>a>>b;
sub(a,b);
cout <<"Введіть дійсну частину та коефіцієнт при уявній частині 1 комплексного числа:";
cin >>r1>>u1;
cout <<"Введіть дійсну частину та коефіцієнт при уявній частині 2 комплексного числа:";
cin >>r2>>u2;
sub(r1,u1,r2,u2);

    return 0;
}