#include <iostream>
#include <cmath>

const int b = 2; //в коді використана як мінімум одна цілочисельна константа

using namespace std;

int main() {
    float y;//в коді використана як мінімум одна дійсна змінна
    int a; //в коді використана як мінімум одна цілочисельна змінна
for (a = 0; a <= 5; a++) {// я не зрозумів умову з 'а' чому дали проміжок тому перебрав від 0 до 5
    cout << "Для a = " << a << " : " << endl;//в коді використано оператори виведення та введення даних   
    for (float x = 1; x <=3; x += 0.1 )
    if (x < b) {//в коді використані умовні оператори та розгалуження
        y = sin(fabs(a*x + pow(b, a)));//в коді використано математичні операції та математичні функції
        cout << "F(x) при x = " << x << " : " << y << endl;
    } else if (x >= b) {
        y = cos(fabs(a*x - pow(b, a)));
        cout << "F(x) при x = " << x << " : " << y << endl;
    }
}
    return 0;
}