#include <iostream>
#include <iomanip>

using namespace std;

int main() {

    cout << "Введіть початкові дані:\n";

    double R1, R2;
    cout << "Величина першого опору (Ом) "; // Оператор виведення
    cin >> R1; // Оператор введення
    cout << "Величина другого опору (Ом) "; // Оператор виведення
    cin >> R2; // Оператор введення

    double R_total = R1 + R2; // Математична операція (додавання)

    cout << fixed << setprecision(2); // Форматування виведення для точності
    cout << "Опір ланцюга: " << R_total << " Ом" << endl; // Оператор виведення

    cout << "----Банк Альфа-омега----" << endl;

    double deposit; // Змінна для депозиту
    const double rate = 0.03; // Константа для процентної ставки

    cout << "Введіть початковий внесок: "; // Оператор виведення
    cin >> deposit; // Оператор введення

    deposit += deposit * rate; // 1 рік - Математична операція (обчислення відсотків)

    deposit += deposit * rate; // 2 рік - Математична операція (обчислення відсотків)

    cout << fixed << setprecision(2); // Форматування виведення для точності 2
    cout << "Сума внеску після 2 років: " << deposit << " грн" << endl; // Оператор виведення

    return 0;
}
