#include <iostream>

using namespace std;

int main(){


float a,b,r;
int k;

cout << "Ціна зошита(грн): ";
cin >>a;
cout << "Ціна обкладинки(грн): ";
cin >>b;
cout << " К-сть комплектів: ";
cin >> k;

r = (a+b)*k;

cout << "Вартість покупки: " << r <<endl;

int KOL,g;
cout << "к-сть шайб, які виготовляє верстат за годину: ";
cin >> KOL;

cout << "к-сть шайб, які виготовляє верстат за 8 годин: " << (8-1)*KOL<< endl; //8-1 бо одна година профілактики
cout << "к-сть шайб, які виготовляє верстат за один робочий день: " << (16-2)*KOL<< endl;//за 2 зміни 2 години профілактики
g = (30-4)*(16-2); // 26 днів він працює(має 4 вихідних)
                   //годину на профілактиці кожної зміни, тому за робочий день верстат працює 16-2= 14 год

cout << "к-сть шайб, які виготовляє верстат за один робочий місяць: " << g*KOL<< endl;       //16 годин - 2 зміни, проте за кожну зміну він стоїть
          


    return 0;
}