#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    long long H;
    long long M;
    long long h[3];  // оголошуємо масив під кількість хітпойнтів витрачених на кожне закляття
    long long m[3];  // оголошуємо масив під кількість мани витраченої на кожне закляття
    int n = 3;
    bool res[3];  // оголошуємо масив під проміжні результати кожного закляття(програв чи переміг персонаж)

    cin >> H;  // вводимо початкову кількість хітпойнтів
    cin >> M;  // вводимо початкову кількість мани

    for (int i = 0; i < n; i++)  // вводимо кількість мани і хітпойнтів витрачених на кожне закляття
    {
        cin >> h[i];
        cin >> m[i];
        
        if (h[i] > 0 && m[i] > 0)  // перевіряємо проміжні результати
        {
            res[i] = 0;  // якщо персонаж витратив і ману і хітпойнти на закляття, записуємо як програш
        }
        else
        {
            res[i] = 1;  // якщо персонаж витратив або те, або інше
        }
      
        H = H - h[i];  // віднімаємо від початкої кількості мани і хітпойнтів ману і хітпойнти, які персонаж витратив на закляття
        M = M - m[i];
    }

    if (res[0] == 1 && res[1] == 1 && res[2] == 1 && H > 0 && M > 0)  // перевіряємо усі умови необхідні для перемоги персонажа
    {
        cout << "YES";
    }
    else
    {
        cout << "NO";
    }

    return 0;
    
}