#include <cstdio>
#include <cmath> // Для функції pow(піднесення в степінь)

int main()
{
    // Оголошуємо наші змінні, і просимо користувача надати їм значення
    double P;
    double r;
    double n;
    double t;
    double A;
    double income;

    printf("Введіть суму вашого депозиту: ");
    scanf("%lf", &P);

    printf("Введіть вашу річну процентну ставку (у відсотках): ");
    scanf("%lf", &r);

    printf("Введіть кількість нарахувань відсотків на рік: ");
    scanf("%lf", &n);

    printf("Введіть час на який ви інвестуєте (у роках): ");
    scanf("%lf", &t);

    // Формула складних відсотків
    A = P * pow(1 + ((r / 100) / n), n * t);
    income = A - P;

    // Виведення результатів
    printf("Ваша інвестиція складає %0.2lf\n", P);
    printf("Період на який ви інвестуєте складає %0.0lf роки(років) \n", t);
    printf("Після цього часу ваші кошти складатимуть %0.2lf\n", A);
    printf("Ваш заробіток складає %0.2lf\n", income);

    return 0;
}