//Написати програму, яка обчислює суму перших n цілих позитивних чисел. 
//Кількість підсумованих чисел повинна вводитися під час роботи програми.

#include <iostream>
#include <cmath>

using namespace std;
int main(){
    int n, sum=0;
    cout << "Введіть кількість цілих позитивних чисел, суму яких ви хочете обчислити: ";
    cin >> n;
    for (int i=1; i<=n; ++i){//цикл фор для проходження по n-й кількості чисел
        sum+=i;
        continue;//оператор для продовження проходження циклу
    }
    cout << "Сума перших " << n << " чисел: " << sum << endl; 
    return 0;
}
