#include <cstdio>
#include <cmath>

int main() {
    double P, r, t;
    int n;


    printf("Введіть основну суму інвестиції (P): ");
    scanf("%lf", &P);
    
    printf("Введіть річну процентну ставку в  десятковій формі (наприклад, 5%% = 0.05): ");
    scanf("%lf", &r);
    
    printf("Введіть кількість нарахувань відсотків на рік (1 - раз на рік, 4 - раз на квартал, 12 - щомісяця): ");
    scanf("%d", &n);
    
    printf("Введіть час (в роках), на який гроші інвестуються: ");
    scanf("%lf", &t);

    double A = P * pow(1 + r / n, n * t);

    printf("Основна сума інвестиції: %.2lf\n", P);
    printf("Річна процентна ставка: %.2lf%%\n", r * 100);
    printf("Кількість нарахувань відсотків на рік: %d\n", n);
    printf("Час інвестицій (в роках): %.2lf\n", t);
    printf("Загальна сума інвестицій (A): %.2lf\n", A);
    printf("Заробіток (A - P): %.2lf\n", A - P);

    return 0;
}