#include <stdio.h>
#include <math.h>
using namespace std;

int main () {
    double P, r, t;
    printf("Введіть основну суму інвестиції: ");
    scanf("%lf", &P);
    printf("Введіть річну процентну ставку (у десятковій формі, тобто 5% = 0,05): ");
    scanf("%lf", &r);
    printf("Введіть час, на який гроші інвестуються (у роках): ");
    scanf("%lf", &t);
    
    printf("\n Вкажіть варіант виплати відсотків\n (введіть 1, якщо виплати мають здійснюватись щомісяця;\n  введіть 2, якщо виплати мають здійснюватись кожного кварталу; \n  введіть 3, якщо виплати мають здійснюватись щороку): \n");
    int o;
    scanf("%d", &o);
    int n;
    if (o=1) 
        n = 12;
    else if (o = 2 ) 
        n = 4;
    else if (o = 3 ) 
        n = 1;
    else {
        printf ("Схоже, ви ввели некоректне значення!");
        }
    double a = P*(pow((1+(r/n)),(n*t)));

    printf("\n Сума вкладених коштів: %.4lf", P);
    printf("\n Загальна сума інвестиції: %.4lf", a);
    printf("\n Сума заробітку: %.4lf", a-P);

    return 0;
}