#include <iostream>
using namespace std;
int main(){
    int n,w,count;
    count = 0;
    w = 2;
    cin >> n;
    while(w > 0){
        w = n / 2;
        n = w;
        count += 1;
        
    }
    cout << count ;

    return 0;
}

/*
Зайчик і нетбук(умова)

Зайчик вирішив перенумерувати всі дерева у лісі, починаючи з номера 0 і закінчуючи номером n (включно), і записати всі номери собі на новенький нетбук. Він знає, що їх буде багато, тому вирішив оптимізувати, використати найменшу можливу кількість бітів для комірки, у яку він буде записувати числа, але так, щоб можна було записати всі потрібні числа.

Якщо у нас комірка має p бітів, тоді найбільше число можна записати 2^p−1.

Input
У єдиному рядку задано ціле число n — номер останнього дерева в лісі.

Output
Єдине ціле число — кількість бітів для комірки.

*/