#include <iostream>

using namespace std;

int main()
{
    int n,m;
    cin>>n>>m;
    cout<<"\nn++-m="<<n++-m;//вийде просто n-m, бо постфіксна операція n дасть на 1 більше під час наступного застосування цієї змінної
    cout<<"\n(m-->n)="<<(m-->n);//вийде просто 1 якщо n+1(з минулої дії)< m, або 0 в інакшому випадку. І не забуваємо, що постфіксна операція m дасть на 1 менше під час наступного застосування
    cout<<"\n(n-->m)="<<(n-->m);//вийде просто 1 якщо n+1> m-1(з минулої дії), або 0 в інакшому випадку. І не забуваємо, що постфіксна операція m дасть на 1 менше під час наступного застосування   
}