 #include <stdio.h> // для функцій printf i scanf
 #include <cmath> // для функції pow
 using namespace std;

 int main() {
    double P, r, n, t, A, suma; // оголошуємо змінні
    printf("Введіть основну суму інвестицій : "); // просимо ввести значення
    scanf("%lf", &P); // привласнюємо значення
    printf("Введіть річну відсоткову ставку у % : ");
    scanf("%lf", &r);
    printf("Введіть кількість нарахувань відсотків на рік : ");
    scanf("%lf", &n);
    printf("Введіть час, на який гроші інвестують (у роках) : ");
    scanf("%lf", &t);

    A = P * pow((1 + (r / (100 * n))), n * t); // розрахуваннясуми інвестицій
    suma = A-P; // розрахування запробітку

    printf("\nВкладені гроші : %lf\n", P); // виведення даних
    printf("Загальна сума інвестицій : %lf\n", A);
    printf("Сума заробітку : %lf", suma);
    return 0;
 }